src/cf/InformationRegisters/УдалитьНастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УдалитьНастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПоложениеРеквизитаНаФорме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПоложениеРеквизитаНаФорме</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ПерсональныеНастройкиРУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Установить настройку пользователя.
// 
// Параметры:
//  ЗначениеНастройки  - Произвольный - Значение настройки
//  ИмяНастройки - Строка - Имя настройки
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - Пользователь
//  Организация - СправочникСсылка.Организации - для настроек, хранимых в разрезе организаций
//
Процедура Установить(ЗначениеНастройки, ИмяНастройки, Пользователь = Неопределено, Организация = Неопределено) Экспорт

	Если ОтсутствуетДоступ(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПредопределенногоЭлемента = СтрШаблон("ПланВидовХарактеристик.НастройкиПользователей.%1", ИмяНастройки);
	ПредопределенныйЭлемент = ОбщегоНазначения.ПредопределенныйЭлемент(ИмяПредопределенногоЭлемента);
	Если ПредопределенныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючОбъектаНастройки = КлючОбъектаНастройки();
	СвойстваНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредопределенныйЭлемент,
		"Ссылка, ИмяПредопределенныхДанных, Наименование, ТипЗначения");
	НастройкиПоОрганизациям = ПланыВидовХарактеристик.НастройкиПользователей.НастройкиПоОрганизациям();
	КлючНастроек = КлючНастроек(СвойстваНастройки, Организация, НастройкиПоОрганизациям);
	Настройки = СвойстваНастройки.ТипЗначения.ПривестиЗначение(ЗначениеНастройки);
	ИмяПользователя = ИмяПользователяПоСсылке(Пользователь);
	ОписаниеНастроек = Новый ОписаниеНастроек;
	ОписаниеНастроек.КлючНастроек = КлючНастроек;
	ОписаниеНастроек.КлючОбъекта = КлючОбъектаНастройки;
	ОписаниеНастроек.Пользователь = ИмяПользователя;
	ОписаниеНастроек.Представление = СвойстваНастройки.Наименование;

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъектаНастройки, КлючНастроек, Настройки, ОписаниеНастроек,
		ИмяПользователя, Истина);

КонецПроцедуры

// Возвращает персональную настройку положения реквизита документа.
// 
// Параметры:
//  ИмяНастройки - Строка - Имя настройки
// 
// Возвращаемое значение:
//  Булево:
//   Истина - реквизит находится в шапке
//   Ложь - реквизит находится в табличной части
Функция РеквизитВШапке(ИмяНастройки) Экспорт
	ЗначениеНастройки = Прочитать(ИмяНастройки, , , Перечисления.ПоложениеРеквизитаНаФорме.ВШапке);
	Если Не ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ЗначениеНастройки = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
КонецФункции

// Прочитать настройку пользователя.
// 
// Параметры:
//  ИмяНастройки - Строка - Имя настройки
//  Организация - СправочникСсылка.Организации - для настроек, хранимых в разрезе организаций
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - если параметр не указан, используется текущий пользователь
//  ЗначениеПоУмолчанию - Неопределено - Значение по умолчанию
// 
// Возвращаемое значение:
//  Произвольный - значение настройки
Функция Прочитать(ИмяНастройки, Организация = Неопределено, Пользователь = Неопределено,
	ЗначениеПоУмолчанию = Неопределено) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("МиграцияПерсональныхНастроекЗавершена") Тогда
		Результат = ПрочитатьЗначениеНастройкиИзУстаревшегоРегистра(ИмяНастройки, Организация, Пользователь);
		Возврат Результат;
	КонецЕсли;

	ИмяПредопределенногоЭлемента = СтрШаблон("ПланВидовХарактеристик.НастройкиПользователей.%1", ИмяНастройки);
	ПредопределенныйЭлемент = ОбщегоНазначения.ПредопределенныйЭлемент(ИмяПредопределенногоЭлемента);
	Если ПредопределенныйЭлемент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	СвойстваНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредопределенныйЭлемент,
		"Ссылка, ИмяПредопределенныхДанных, ТипЗначения");
	НастройкиПоОрганизациям = ПланыВидовХарактеристик.НастройкиПользователей.НастройкиПоОрганизациям();
	КлючНастроек = КлючНастроек(СвойстваНастройки, Организация, НастройкиПоОрганизациям);
	ИмяПользователя = ИмяПользователяПоСсылке(Пользователь);

	Если ЗначениеПоУмолчанию = Неопределено Тогда
		ЗначениеПоУмолчанию = СвойстваНастройки.ТипЗначения.ПривестиЗначение();
	КонецЕсли;

	Результат = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъектаНастройки(), КлючНастроек,
		ЗначениеПоУмолчанию, , ИмяПользователя);

	Возврат Результат;

КонецФункции

// Значения настроек.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - 
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - ключ настройки
//  * Значение - Произвольный - значение настройки
Функция ЗначенияНастроек(Пользователь) Экспорт
	Результат = Новый Соответствие;
	Отбор = Новый Структура("КлючОбъекта, Пользователь", КлючОбъектаНастройки(), ИмяПользователяПоСсылке(Пользователь));
	Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.КлючНастроек] = Выборка.Настройки;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Выборка всех пользовательских настроек.
// 
// Возвращаемое значение:
//  СтандартноеХранилищеНастроекВыборка
Функция ВсеНастройки() Экспорт
	КлючОбъектаНастройки = КлючОбъектаНастройки();
	Отбор = Новый Структура("КлючОбъекта", КлючОбъектаНастройки);
	Результат = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Возврат Результат;
КонецФункции

// Извлечь значение настройки по ключевым полям.
// 
// Параметры:
//  СвойстваНастройки - Структура - Свойства настройки:
//  * Ссылка - ПланВидовХарактеристикСсылка.НастройкиПользователей
//  * ИмяПредопределенныхДанных - Строка
//  * ТипЗначения - ОписаниеТипов
//  ЗначенияНастроек - см. ЗначенияНастроек
//  Организация - СправочникСсылка.Организации - Организация
//  НастройкиПоОрганизациям - см. ПланыВидовХарактеристик.НастройкиПользователей.НастройкиПоОрганизациям
// 
// Возвращаемое значение:
//  Произвольный
Функция Извлечь(СвойстваНастройки, ЗначенияНастроек, Организация, НастройкиПоОрганизациям) Экспорт
	КлючНастроек = КлючНастроек(СвойстваНастройки, Организация, НастройкиПоОрганизациям);
	Результат = ЗначенияНастроек[КлючНастроек];
	Если Результат = Неопределено Тогда
		Результат = СвойстваНастройки.ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Функция возвращает значение настройки зачета авансов.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ДаНет - значение настройки зачета авансов.
Функция ЗачетАвансов() Экспорт
	Результат = Прочитать("ЗачитыватьАвансыДолгиАвтоматически");
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	Результат = ПолучитьФункциональнуюОпцию("ЗачитыватьАвансыДолгиАвтоматически");
	Возврат Результат;
КонецФункции

// Возвращает количество различных значений настройки пользователя
// 
// Параметры:
//  ИмяНастройки - Строка - имя настройки. Поиск выполняется по префиксу настройки
// См. ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение
//  * Ключ - Булево,СправочникСсылка - значение настройки
//  * Значение - Число - количество настроек с таким значением
Функция КоличествоЗначенийНастройки(ИмяНастройки) Экспорт
	Результат = Новый Соответствие;
	СтрокаПоиска = ВРег(Лев(ИмяНастройки, 96));
	Отбор = Новый Структура("КлючОбъекта", КлючОбъектаНастройки());
	ВыборкаНастроек = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Пока ВыборкаНастроек.Следующий() Цикл
		Если Не СтрНачинаетсяС(ВРег(ВыборкаНастроек.КлючНастроек), СтрокаПоиска) Тогда
			Продолжить;
		КонецЕсли;
		КлючЗначенияНастройки = КлючЗначенияНастройки(ВыборкаНастроек.Настройки);
		Если Результат[КлючЗначенияНастройки] = Неопределено Тогда
			Результат[КлючЗначенияНастройки] = 0;
		КонецЕсли;
		Результат[КлючЗначенияНастройки] = Результат[КлючЗначенияНастройки] + 1;
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Мигрировать(ПараметрыОбработчика) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПользователей.Пользователь КАК Пользователь,
	|	НастройкиПользователей.Пользователь.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	|	НастройкиПользователей.Настройка КАК Ссылка,
	|	НастройкиПользователей.Настройка.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	НастройкиПользователей.Настройка.Наименование КАК Наименование,
	|	НастройкиПользователей.Организация КАК Организация,
	|	НастройкиПользователей.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.УдалитьНастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь <> &НеуказанныйПользователь
	|	И НЕ НастройкиПользователей.Пользователь.ИдентификаторПользователяИБ ЕСТЬ NULL";
	Запрос.УстановитьПараметр("НеуказанныйПользователь", Пользователи.СсылкаНеуказанногоПользователя());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	КлючОбъектаНастройки = КлючОбъектаНастройки();
	НастройкиПоОрганизациям = ПланыВидовХарактеристик.НастройкиПользователей.НастройкиПоОрганизациям();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СвойстваНастройки = Новый Структура("Ссылка, ИмяПредопределенныхДанных, Наименование");
		ЗаполнитьЗначенияСвойств(СвойстваНастройки, Выборка);
		ИспользуетсяНастройкаПоОрганизациям = НастройкиПоОрганизациям.Найти(СвойстваНастройки.Ссылка) <> Неопределено;
		Если ИспользуетсяНастройкаПоОрганизациям И Не ЗначениеЗаполнено(Выборка.Организация) Тогда
			Продолжить;
		КонецЕсли;
		КлючНастроек = КлючНастроек(СвойстваНастройки, Выборка.Организация, НастройкиПоОрганизациям);
		СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(Выборка.ИдентификаторПользователяИБ);
		Если СвойстваПользователяИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеНастроек(КлючНастроек, СвойстваПользователяИБ.Имя, СвойстваНастройки.Наименование);
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъектаНастройки, КлючНастроек, Выборка.Значение, ,
			СвойстваПользователяИБ.Имя, Ложь);
	КонецЦикла;

	МиграцияПерсональныхНастроекЗавершена = Константы.МиграцияПерсональныхНастроекЗавершена.СоздатьМенеджерЗначения();
	МиграцияПерсональныхНастроекЗавершена.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МиграцияПерсональныхНастроекЗавершена);

КонецПроцедуры

Процедура ПропуститьКопирование(ИсключенияПоКлючуОбъекта, ИсключенияПоКлючуНастроек) Экспорт

	ИсключенияПоКлючуОбъекта.Добавить(КлючОбъектаНастройки());
	ИсключенияПоКлючуНастроек.Добавить("ОсновнойКалендарь");
	ИсключенияПоКлючуНастроек.Добавить("ОсновнойОтветственный");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтсутствуетДоступ(Пользователь)
	Если Пользователь = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Пользователь = Пользователи.ТекущийПользователь() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ПравоДоступа("АдминистрированиеДанных", Метаданные) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

// Ключ настроек.
// 
// Параметры:
//  СвойстваНастройки - Структура - Свойства настройки:
// * Ссылка - ПланВидовХарактеристикСсылка.НастройкиПользователей
// * ИмяПредопределенныхДанных - Строка
//  Организация - СправочникСсылка.Организации, Неопределено - Организация
//  НастройкиПоОрганизациям - см. ПланыВидовХарактеристик.НастройкиПользователей.НастройкиПоОрганизациям
// 
// Возвращаемое значение:
//  Строка - Ключ настроек
Функция КлючНастроек(СвойстваНастройки, Организация, НастройкиПоОрганизациям)
	КомпонентыКлюча = Новый Массив;
	КомпонентыКлюча.Добавить(СвойстваНастройки.ИмяПредопределенныхДанных);
	ДополнитьКлючОрганизацией(КомпонентыКлюча, СвойстваНастройки, Организация, НастройкиПоОрганизациям);
	Результат = СтрСоединить(КомпонентыКлюча, "/");
	Возврат Результат;
КонецФункции

Процедура ДополнитьКлючОрганизацией(КомпонентыКлюча, СвойстваНастройки, Организация, НастройкиПоОрганизациям)
	Если НастройкиПоОрганизациям.Найти(СвойстваНастройки.Ссылка) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Организация = Неопределено Тогда
		КлючОрганизации = Справочники.Организации.ОрганизацияПоУмолчанию().УникальныйИдентификатор();
	Иначе
		КлючОрганизации = Организация.УникальныйИдентификатор();
	КонецЕсли;
	КомпонентыКлюча.Добавить(КлючОрганизации);
КонецПроцедуры

Функция ИмяПользователяПоСсылке(Пользователь)
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат ИмяПользователя();
	КонецЕсли;
	Если Пользователь = Пользователи.СсылкаНеуказанногоПользователя() Тогда
		Если Пользователь = Пользователи.ТекущийПользователь() Тогда
			Возврат Неопределено;
		Иначе
			ВызватьИсключение НСтр("ru = 'Отсутствует возможность обратиться к настройке неуказанного пользователя.'");
		КонецЕсли;
	КонецЕсли;
	Если Пользователь = Пользователи.ТекущийПользователь() Тогда
		Возврат ИмяПользователя();
	КонецЕсли;
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь,
		"ИдентификаторПользователяИБ, Служебный");
	Если РеквизитыПользователя.Служебный Тогда
		Возврат ИмяПользователя();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(РеквизитыПользователя.ИдентификаторПользователяИБ);
	УстановитьПривилегированныйРежим(Ложь);
	Если СвойстваПользователяИБ = Неопределено Тогда
		ТекстИсключения = СтрШаблон(НСтр(
			"ru = 'Не удалось определить имя пользователя информационной базы для ""%1"".'"), Пользователь);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Возврат СвойстваПользователяИБ.Имя;
КонецФункции

Функция ОписаниеНастроек(КлючНастроек, ИмяПользователя, Представление)
	Результат = Новый ОписаниеНастроек;
	Результат.КлючНастроек = КлючНастроек;
	Результат.КлючОбъекта = КлючОбъектаНастройки();
	Результат.Пользователь = ИмяПользователя;
	Результат.Представление = Представление;
	Возврат Результат;
КонецФункции

// Ключ объекта настройки.
// 
// Возвращаемое значение:
//  Строка - Ключ объекта настройки
Функция КлючОбъектаНастройки()
	Возврат "ПерсональныеНастройкиРУНФ";
КонецФункции

Функция ПрочитатьЗначениеНастройкиИзУстаревшегоРегистра(Настройка, Организация = Неопределено,
	Пользователь = Неопределено)

	СвойстваНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ПланыВидовХарактеристик.НастройкиПользователей[Настройка], "Ссылка, ИмяПредопределенныхДанных, ТипЗначения");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Если Пользователь <> Неопределено Тогда
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Иначе
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Значение
	|ИЗ
	|	РегистрСведений.УдалитьНастройкиПользователей
	|ГДЕ
	|	Пользователь = &Пользователь
	|	И Настройка = &Настройка";

	Если ЗначениеЗаполнено(Организация) Тогда

		ТекстДополненияЗапроса = " И Организация = &Организация";
		Запрос.Текст = Запрос.Текст + ТекстДополненияЗапроса;
		Запрос.УстановитьПараметр("Организация", Организация);

	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();

	ПустоеЗначение = СвойстваНастройки.ТипЗначения.ПривестиЗначение();

	Если Выборка.Количество() = 0 Тогда

		Возврат ПустоеЗначение;

	ИначеЕсли Выборка.Следующий() Тогда
		Если Не ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
	Иначе
		Возврат ПустоеЗначение;
	КонецЕсли;

КонецФункции

Функция КлючЗначенияНастройки(ЗначениеНастройки)
	Если ТипЗнч(ЗначениеНастройки) = Тип("Строка") Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	Если ТипЗнч(ЗначениеНастройки) = Тип("Булево") Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ЗначениеНастройки) Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	Результат = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ЗначениеНастройки);
	Возврат Результат;
КонецФункции

#КонецОбласти
